## 10.1 GroupBy Mechanics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.597686
b    0.141929
Name: data1, dtype: float64

In [7]:
grouped2 = df['data2'].groupby(df['key2'])

In [8]:
grouped2.mean()

key2
one   -0.215131
two    0.387497
Name: data2, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -1.077356
      two     0.361653
b     one    -0.001405
      two     0.285263
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -1.077356  0.361653
b    -0.001405  0.285263

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005    0.361653
            2006   -0.001405
Ohio        2005   -0.255912
            2006   -1.357625
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.597686  0.031625
b     0.141929  0.017364

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.077356 -0.147927
     two   0.361653  0.390727
b    one  -0.001405 -0.349539
     two   0.285263  0.384267

In [17]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [18]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950
b
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [20]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
4    a  one -1.357625 -0.100950
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.361653  0.390727
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.285263  0.384267

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267

In [23]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
4    a  one -1.357625 -0.100950

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
grouped

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.797087 -0.194903
1  0.361653  0.390727
2 -0.001405 -0.349539
3  0.285263  0.384267
4 -1.357625 -0.100950
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Select a Column or Subset of Columns

In [28]:
df.groupby('key1')['data1']

In [29]:
df.groupby('key1')[['data2']]

In [30]:
df['data1'].groupby(df['key1'])

In [31]:
df[['data2']].groupby(df['key1'])

In [32]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.147927
     two   0.390727
b    one  -0.349539
     two   0.384267

In [33]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [34]:
s_grouped

In [35]:
s_grouped.mean()

key1  key2
a     one    -0.147927
      two     0.390727
b     one    -0.349539
      two     0.384267
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [36]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [37]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [38]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [39]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 
           'd': 'blue', 'e': 'red', 'f':'orange'}

In [40]:
by_column = people.groupby(mapping, axis=1)

In [41]:
by_column.sum()

            blue       red
Joe    -1.580251  1.036824
Steve  -0.363890  1.209377
Wes    -0.229374  0.077696
Jim    -0.630196  0.366059
Travis  1.238357  1.966726

In [42]:
map_series = pd.Series(mapping)

In [43]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [44]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [45]:
people.groupby(map_series, axis=1).mean()

            blue       red
Joe    -0.790125  0.345608
Steve  -0.181945  0.403126
Wes    -0.229374  0.038848
Jim    -0.315098  0.122020
Travis  0.619178  0.655575

### Grouping with Functions

In [46]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.344317  0.918391 -0.862197 -1.577623 -0.782128
5  0.585750  0.217250 -0.046256 -0.317634  0.406377
6  0.133309  0.570878  0.367237  0.871120  1.262539

In [47]:
people

               a         b         c         d         e
Joe     0.683157  0.631199 -1.377416 -0.202835 -0.277532
Steve   0.585750  0.217250 -0.046256 -0.317634  0.406377
Wes     0.066338       NaN       NaN -0.229374  0.011357
Jim     0.594821  0.287191  0.515219 -1.145414 -0.515954
Travis  0.133309  0.570878  0.367237  0.871120  1.262539

In [48]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [49]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.066338  0.631199 -1.377416 -0.229374 -0.277532
  two  0.594821  0.287191  0.515219 -1.145414 -0.515954
5 one  0.585750  0.217250 -0.046256 -0.317634  0.406377
6 two  0.133309  0.570878  0.367237  0.871120  1.262539

### Grouping by Index Levels

In [50]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [51]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [52]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [53]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.924563  1.317659 -3.020106  2.356310  0.756303
1      0.637641 -0.109088 -0.526210 -0.122377 -1.265956
2     -0.799849 -0.408841  1.228000  1.200175  0.237341
3     -1.413123  1.209267 -0.298955 -0.515657  0.982154

In [54]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 Data Aggregation

In [55]:
df

  key1 key2     data1     data2
0    a  one -0.797087 -0.194903
1    a  two  0.361653  0.390727
2    b  one -0.001405 -0.349539
3    b  two  0.285263  0.384267
4    a  one -1.357625 -0.100950

In [56]:
grouped = df.groupby('key1')

In [60]:
grouped['data1'].nsmallest(2)

key1
a     4   -1.357625
      0   -0.797087
b     2   -0.001405
      3    0.285263
Name: data1, dtype: float64

In [58]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [59]:
grouped.agg(peak_to_peak)

/var/folders/jf/gt_0n5l11fb60xg7lyjrbvbw0000gn/T/ipykernel_93667/4193407341.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.719278  0.585630
b     0.286668  0.733806

In [61]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.597686  0.876812 -1.357625 -1.077356 -0.797087 -0.217717
b      2.0  0.141929  0.202705 -0.001405  0.070262  0.141929  0.213596

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.361653   3.0  0.031625  0.314520 -0.194903 -0.147927 -0.100950
b     0.285263   2.0  0.017364  0.518879 -0.349539 -0.166087  0.017364


           75%       max
key1
a     0.144888  0.390727
b     0.200816  0.384267

### Column-Wise and Multiple Function Application

In [62]:
tips = pd.read_csv("examples/tips.csv")

In [63]:
tips

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [64]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [65]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [66]:
grouped = tips.groupby(['day', 'smoker'])

In [67]:
grouped_pct = grouped['tip_pct']

In [68]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [69]:
grouped.mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

In [71]:
grouped_pct.mean()

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [72]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [73]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [74]:
functions = ['count', 'mean', 'max']

In [77]:
result = grouped[['tip_pct', 'total_bill']].agg(functions)

In [78]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [79]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [80]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [82]:
grouped[['tip_pct', 'total_bill']].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [83]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [84]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40